---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend
source: html/721c282f-d82e-1667-3307-9754af056447.htm
---
# AnalysisDisplayLegend Properties

The id of the assembly instance to which the element belongs.